/* eslint-disable import/no-anonymous-default-export */
import React from 'react'

export default
{
  "title": "Факультет комп’ютерних наук та кібернетики",
  "titleShort": "ФКНК",
  "id": "faculty-csc",
  "viewBox": "0 0 1807.1 655",
  "svgBackground": <path className='background' d='M 1306.2,470.5 V 91 h -15 v 14 h -95.4 V 0 H 1181 v 14 h -48 V 0 h -14.8 v 65 h -70.1 v 40 h -45.9 -26 H 897 V 91 H 882 V 470.5 H 523 v -141 H 292.5 v 61 H 47 v 115 h 20.5 v 34 H 47 v 25 h 20.5 v 53 H 50 v 6 h 844.9 l 460.7,31.5 h 401.6 V 470.5 Z'/>,
  "svgForeground": <g className='outline'> <path id='path21' d='M1306.2,470.5V91h-15v14h-95.3V0H1181v14h-48V0h-14.8v65h-70.1v40h-45.9h-26H897V91h-15v379.5H523v-141H292.5   v61H47v115h20.5v34H47v25h20.5v53H0v6h894.9l460.7,31.5l451.6,0v-6h-50V470.5H1306.2z M1295.2,109V95h7v375.5h-61.8v2h-42.5V181h-2   v-72H1295.2z M1039.1,627.3V595h9v33L1039.1,627.3z M1035.1,591v36.1l-51.1-3.5V204h107.2v426.9l-39.1-2.7V591H1035.1z    M945.5,618.5v-11H968v11H945.5z M941.5,603.5v17.2l-7-0.5v-16.7H904v14.6l-6-0.4V476.5h80v146.7l-9.8-0.7h3.8v-19H941.5z    M908,618.4v-10.9h22.5v11h-20.8L908,618.4z M1116.2,591h-21v-10h21V591z M1116.2,577h-21v-36h21V577z M1116.2,537h-21v-10h21V537z    M1116.2,523h-21v-36h21V523z M1116.2,483h-21v-10h21V483z M1116.2,469h-21v-36h21V469z M1116.2,429h-21v-10h21V429z M1116.2,415   h-21v-36h21V415z M1116.2,375h-21v-10h21V375z M1116.2,361h-21v-36h21V361z M1116.2,321h-21v-10h21V321z M1116.2,307h-21v-36h21   V307z M1116.2,267h-21v-10h21V267z M1116.2,253h-21v-36h21V253z M1116.2,213h-21v-9h21V213z M1118.2,181h-2v17h-103.1v-49h105.1   V181z M1095.2,595h21v37.6l-21-1.4V595z M1122.2,184.5h69.7v453.3l-69.7-4.8V184.5z M1197.8,476.5h42.5v164.6l-42.5-2.9V476.5z    M1129,4v14h56V4h6.8v176.5h-69.7V4H1129z M1052.1,69h66.1v36h-66.1V69z M886,95h7v14h83.2h26h116v36h-109.1v53H978v274.5h-80v-2   h-12V95z M892,476.5v141h-6v-48h-27.8v48h-7v-48h-27.8v48h-7v-48h-27.8v48h-7v-48H754v48H523v-53v-3v-22v-63H892z M862.3,617.5v-44   H882v44H862.3z M827.5,617.5v-44h19.8v44H827.5z M792.8,617.5v-44h19.8v44H792.8z M758,617.5v-44h19.8v44H758z M217.5,564.5v53h-69   v-53H217.5z M223.5,564.5H285h7.5v53h-69V564.5z M217.5,505.5v34h-69v-34H217.5z M223.5,505.5h69v34H285h-61.5V505.5z M442,505.5   v34h-69v-34H442z M448,505.5h69v34h-69V505.5z M298.5,499.5v-24H517v24H298.5z M517,471.5h-69v-16h69V471.5z M442,471.5h-69v-16h69   V471.5z M367,471.5h-68.5v-16H367V471.5z M292.5,481.5H244v-36h48.5V481.5z M238,435.4h-45.9l45.9-36.9V435.4z M244,485.5h48.5v14   H244V485.5z M298.5,505.5H367v34h-68.5V505.5z M517,545.5v13H298.5v-13H517z M517,599.5h-69v-35h69V599.5z M298.5,564.5H367v35   h-68.5V564.5z M373,564.5h69v35h-69V564.5z M298.5,603.5H367v14h-68.5V603.5z M373,603.5h69v14h-69V603.5z M448,603.5h69v14h-69   V603.5z M517,335.5v116H298.5v-116H517z M292.5,441.5H244v-45h48.5V441.5z M234.1,396.5l-48.9,39.3l1.3,3.6H238v12.1h-62.3v4H238   v44h-50.6l-45.9-70.8h34.2v-4h-36.8l-8.5-13.1l-3.4,2.2l7.1,10.9H83.4v4h53.3l11.4,17.6L53,456.4v-59.9H234.1z M53,487.7l48-5.1   l-0.4-4l-47.6,5v-23.2l97.6-10.3l32,49.4H53V487.7z M73.5,505.5h69v34h-69V505.5z M53,545.5h232h7.5v13H285H53V545.5z M73.5,564.5   h69v53h-69V564.5z M1751.2,649h-395.3l-109.5-7.5v-165h57.8h447V649z' className='st2' /> <path id='path23' d='M661,569.5h-57v34h57V569.5z M657,599.5h-49v-26h49V599.5z' className='st2' /> <path id='path25' d='M586,569.5h-57v34h57V569.5z M582,599.5h-49v-26h49V599.5z' className='st2' /> <path id='path27' d='M736,569.5h-57v34h57V569.5z M732,599.5h-49v-26h49V599.5z' className='st2' /> <path id='path29' d='M661,510.5h-57v34h57V510.5z M657,540.5h-49v-26h49V540.5z' className='st2' /> <path id='path31' d='M586,510.5h-57v34h57V510.5z M582,540.5h-49v-26h49V540.5z' className='st2' /> <path id='path33' d='M811,510.5h-57v34h57V510.5z M807,540.5h-49v-26h49V540.5z' className='st2' /> <path id='path35' d='M886,510.5h-57v34h57V510.5z M882,540.5h-49v-26h49V540.5z' className='st2' /> <path id='path37' d='M1302.2,576h57v-34h-57V576z M1306.2,546h49v26h-49V546z' className='st2' /> <path id='path39' d='M1302.2,630h57v-34h-57V630z M1306.2,600h49v26h-49V600z' className='st2' /> <path id='path41' d='M1434.2,542h-57v34h57V542z M1430.2,572h-49v-26h49V572z' className='st2' /> <path id='path43' d='M1434.2,596h-57v34h57V596z M1430.2,626h-49v-26h49V626z' className='st2' /> <path id='path45' d='M1509.2,542h-57v34h57V542z M1505.2,572h-49v-26h49V572z' className='st2' /> <path id='path47' d='M1509.2,596h-57v34h57V596z M1505.2,626h-49v-26h49V626z' className='st2' /> <path id='path49' d='M1584.2,542h-57v34h57V542z M1580.2,572h-49v-26h49V572z' className='st2' /> <path id='path51' d='M1584.2,596h-57v34h57V596z M1580.2,626h-49v-26h49V626z' className='st2' /> <path id='path53' d='M1659.2,542h-57v34h57V542z M1655.2,572h-49v-26h49V572z' className='st2' /> <path id='path55' d='M1659.2,596h-57v34h57V596z M1655.2,626h-49v-26h49V626z' className='st2' /> <path id='path57' d='M1734.2,542h-57v34h57V542z M1730.2,572h-49v-26h49V572z' className='st2' /> <path id='path59' d='M1734.2,596h-57v34h57V596z M1730.2,626h-49v-26h49V626z' className='st2' /> <path id='path61' d='M904,514.5h30.5v-19H904V514.5z M908,499.5h22.5v11H908V499.5z' className='st2' /> <path id='path63' d='M904,568.5h30.5v-19H904V568.5z M908,553.5h22.5v11H908V553.5z' className='st2' /> <path id='path65' d='M972,495.5h-30.5v19H972V495.5z M968,510.5h-22.5v-11H968V510.5z' className='st2' /> <path id='path67' d='M1052.1,483h-17v44h17V483z M1048.1,523h-9v-36h9V523z' className='st2' /> <path id='path69' d='M1052.1,537h-17v44h17V537z M1048.1,577h-9v-36h9V577z' className='st2' /> <path id='path71' d='M1052.1,375h-17v44h17V375z M1048.1,415h-9v-36h9V415z' className='st2' /> <path id='path73' d='M1052.1,429h-17v44h17V429z M1048.1,469h-9v-36h9V469z' className='st2' /> <path id='path75' d='M1052.1,321h-17v44h17V321z M1048.1,361h-9v-36h9V361z' className='st2' /> <path id='path77' d='M1052.1,213h-17v44h17V213z M1048.1,253h-9v-36h9V253z' className='st2' /> <path id='path79' d='M1185,25h-56v84h56V25z M1181,105h-48V29h48V105z' className='st2' /> <path id='path81' d='M1052.1,267h-17v44h17V267z M1048.1,307h-9v-36h9V307z' className='st2' /> <path id='path83' d='M972,549.5h-30.5v19H972V549.5z M968,564.5h-22.5v-11H968V564.5z' className='st2' /> <path id='path85' d='M1203.8,622.5h30.5v-19h-30.5V622.5z M1207.8,607.5h22.5v11h-22.5V607.5z' className='st2' /> <path id='path87' d='M1203.8,495.5v19h30.5v-19H1203.8z M1230.3,510.5h-22.5v-11h22.5V510.5z' className='st2' /> <path id='path89' d='M1203.8,568.5h30.5v-19h-30.5V568.5z M1207.8,553.5h22.5v11h-22.5V553.5z' className='st2' /> <path id='path91' d='M1253.7,622.5h30.5v-19h-30.5V622.5z M1257.7,607.5h22.5v11h-22.5V607.5z' className='st2' /> <path id='path93' d='M1253.7,568.5h30.5v-19h-30.5V568.5z M1257.7,553.5h22.5v11h-22.5V553.5z' className='st2' /> <path id='path95' d='M736,510.5h-57v34h57V510.5z M732,540.5h-49v-26h49V540.5z' className='st2' /> </g>,
  "floors": [
    {
      "num": "0",
      "id": "floor-0",
      "name": "Поверх 0",
      "description": "Інформаційно-обчислювальний центр університету.",
      "path": "m 894.9,623.5 460.7,31.5 h 401.6 V 581 H 894.9 Z"
    },{
      "num": "1",
      "id": "floor-1",
      "name": "Поверх 1",
      "description": "Центральний хол, Кафедри Дослідження операцій, Обчислювальної математики.",
      "path": "M 1306.2,527 H 895.1 v 25 H 47 v 12.5 h 20.5 v 53 H 50 v 6 H 894.9 V 581 h 862.3 v -54 z"
    },{
      "num": "2",
      "id": "floor-2",
      "name": "Поверх 2",
      "description": "Деканат ФКНК, Деканат ФС, Буфет.",
      "path": "m 1303.6,470.5 h -63.3 v 2 h -42.5 V 473 H 882 v -2.5 H 523 v 22 H 47 v 13 h 20.5 v 34 H 47 V 552 h 848.1 v -25 h 302.7 1.9 103.9 2.6 v -56.5 z"
    },{
      "num": "3",
      "id": "floor-3",
      "name": "Поверх 3",
      "description": "Великі лекційні аудиторії, Кафедри Моделювання складних систем, Системного аналізу та теорії прийняття рішень, Теоретичної кібернетики.",
      "path": "M 292.5 329.5 L 292.5 390.5 L 47 390.5 L 47 492.5 L 523 492.5 L 523 470.5 L 523 469.09961 L 523 329.5 L 292.5 329.5 z M 882 419 L 882 470.5 L 882 473 L 1197.8008 473 L 1197.8008 472.5 L 1240.3008 472.5 L 1240.3008 470.5 L 1306.1992 470.5 L 1306.1992 419 L 882 419 z "
    },{
      "num": "4",
      "id": "floor-4",
      "name": "Поверх 4",
      "description": "Кафедри Теорії та історії соціології, Галузевої соціології, Методології та методів соціологічних досліджень, Соціальних структур та соціальних відносин.",
      "path": "m 882,365 h 424.1 v 54 H 882 Z"
    },{
      "num": "5",
      "id": "floor-5",
      "name": "Поверх 5",
      "description": "Кафедри Теорії та технології програмування, Системного аналізу та теорії прийняття рішень, Інтелектуальних програмних систем.",
      "path": "m 882,311 h 424.1 v 54 H 882 Z"
    },{
      "num": "6",
      "id": "floor-6",
      "name": "Поверх 6",
      "description": "Кафедри Математичної інформатики, Прикладної статистики.",
      "path": "m 882,257 h 424.1 v 54 H 882 Z"
    }
  ]
}